# -*- coding: utf-8 -*-
"""Sample config for the momotaro.
"""


################################################################
#
# Sample:
#
# 1) PERSONS
#       人物簡易設定
# 2) STAGES
#       舞台基本設定
# 3) DAYS
#       年月日設定
# 4) TIMES
#       時間帯基本設定
# 5) ITEMS
#       小道具設定
# 6) WORDS
#       辞書設定
# 7) RUBIS
#       ルビ設定
# 8) LAYERS
#       レイヤ設定
#
################################################################


PERSONS = (
        # Tag / 氏,名 / 歳 / 性別 / 職業 / 呼称 / 紹介
        ("taro", "桃太郎", "", 15, "male", "無職", "me:俺"),
        ("granpa", "おじいさん", "守屋,源三郎", 75, "male", "木こり", "me:儂:S:おじいさん:granma:お前"),
        ("granma", "おばあさん", "守屋,富", 74, "female", "農家", "me:私:S:おばあさん:granpa:あなた"),
        ("daemon", "鬼", "", 35, "male", "鬼", "me:ワイ"),
        ("dog", "犬助", "", 18, "male", "犬", "me:ボク"),
        ("monkey", "猿衛門", "", 16, "male", "猿", "me:オイラ"),
        ("bird", "雉子", "", 17, "female", "雉", "me:わたし"),
        )

STAGES = (
        # Tag / 名前 / 紹介
        ("river", "川辺"),
        ("home", "太郎の家"),
        ("vila", "村"),
        ("street", "路上"),
        ("ship", "船"),
        ("island", "鬼ヶ島", "村からは十日かかる"),
        )

DAYS = (
        # Tag / 名前 / 月 / 日 / 年
        ("birth", "太郎生まれた", 7,7, 10),
        ("voyage", "出発の日", 10,1, 13),
        ("meetdog", "犬に会う", 10,4, 13),
        ("rideship", "船にて", 10,10, 13),
        ("arrived", "鬼ヶ島に到着", 10,11, 13),
        ("backhome", "村に帰る", 10,21, 13),
        )

TIMES = (
        # Tag / 名前 / 時 / 分
        )

ITEMS = (
        # Tag / 名前 / 紹介
        ("peach", "桃"),
        ("dango", "吉備団子", "家来を餌付けするための団子"),
        ("floor", "床"),
        ("ceil", "天井"),
        ("wall", "壁"),
        ("water", "水"),
        ("tree", "木"),
        ("land", "陸"),
        ("cloth_momo1", "桃太郎の服"),
        ("cloth_momo2", "桃太郎の服（外出着）"),
        ("katana", "刀"),
        ("flag", "旗"),
        ("cloth_boro", "ボロ着"),
        ("blade", "ナタ"),
        )

WORDS = (
        # Tag / 名前 / 紹介
        ("daemon", "鬼"),
        )

RUBIS = (
        # Base / Rubi / Type
        ("桃太郎", "｜桃太郎《ももたろう》", "", 1),
        ("桃", "｜桃《モモ》", ("桃太郎", "桃太"), 2),
        ("吉備団子", "｜吉備団子《きびだんご》", "", 1),
        ("木の棒", "｜木の棒《きのぼう》", "", 1),
        ("富", "｜富《とみ》", "", 1),
        )

LAYERS = (
        ("main", "桃太郎", ("桃太郎", "桃")),
        ("buster", "鬼退治", ("鬼", "鬼退治", "退治")),
        )
