# -*- coding: utf-8 -*-
"""Sample config for the momotaro.
"""


################################################################
#
# Sample:
#
# 1) CHARAS
#       人物簡易設定
# 2) STAGES
#       舞台基本設定
# 3) DAYS
#       年月日設定
# 4) TIMES
#       時間帯基本設定
# 5) ITEMS
#       小道具設定
# 6) WORDS
#       辞書設定
#
################################################################


PERSONS = (
        # Tag / 氏,名 / 歳 / 性別 / 職業 / 呼称 / 紹介
        ("taro", "桃太郎", "", 15, "male", "無職", "me:俺"),
        ("granpa", "源三郎", "", 75, "male", "木こり", "me:儂:S:おじいさん:granma:お前"),
        ("granma", "富", "", 74, "female", "農家", "me:私:S:おばあさん:granpa:あなた"),
        ("daemon1", "赤鬼", "", 35, "male", "鬼", "me:ワイ"),
        ("dog", "犬助", "", 18, "male", "犬", "me:ボク"),
        ("monkey", "猿衛門", "", 16, "male", "猿", "me:オイラ"),
        ("pheasant", "雉子", "", 17, "female", "雉", "me:わたし"),
        )

CHARAS = (
        )

STAGES = (
        # Tag / 名前 / 紹介
        ("river", "川辺"),
        ("home", "太郎の家"),
        ("vila", "村"),
        ("onstreet", "路上"),
        ("onship", "船"),
        ("island", "鬼ヶ島", "村からは十日かかる"),
        )

DAYS = (
        # Tag / 名前 / 月 / 日 / 年
        ("getpeach", "桃拾った", 7,7, 10),
        ("birth", "太郎生まれた", 7,7, 10),
        ("rumor", "鬼の噂", 9,1, 13),
        ("voyage", "出発の日", 10,1, 13),
        ("meetdog", "犬に会う", 10,4, 13),
        ("rideship", "船にて", 10,10, 13),
        ("arrived", "鬼ヶ島に到着", 10,11, 13),
        ("backhome", "村に帰る", 10,21, 13),
        )

TIMES = (
        # Tag / 名前 / 時 / 分
        ("morning", "朝", 8, 0),
        ("afternoon", "午後", 14, 0),
        ("night", "夜", 19, 0),
        )

ITEMS = (
        # Tag / 名前 / 紹介
        ("peach", "桃"),
        ("dango", "吉備団子", "家来を餌付けするための団子"),
        )

WORDS = (
        # Tag / 名前 / 紹介
        ("island", "鬼ヶ島"),
        )

RUBIS = (
        # Base / Rubi / Type
        ("桃太郎", "桃太郎《ももたろう》", "", 1),
        ("桃", "桃《モモ》", ("桃太郎", "桃太"), 2),
        )
