# -*- coding: utf-8 -*-
## foods common data


## common defines
__FOOD_LAYER__ = "__food__"

## meta data
FOOD_LAYERS = (
        (__FOOD_LAYER__ + "food", "食べ物",
            (
                "食べ物",
                "朝食", "昼食", "夕食", "夜食", "間食", "完食",
                "麺", "うどん", "饂飩", "蕎麦", "そば", "ラーメン", "パスタ", "スパゲッティ", "焼きそば", "やきそば",
                "ご飯", "白米", "玄米", "ごはん",
                "寿司",
                "味噌汁", "みそ汁",
                "漬物", "お新香", "おしんこ",
                "スープ", "シチュー", "ポトフ",
                "おかず",
                "回鍋肉", "ホイコーロー", "麻婆豆腐", "マーボー豆腐",
                "サムゲタン", "参鶏湯",
                "サムギョプサル",
                "カレー",
                "オムライス", "オムレツ",
                "目玉焼き",
                "パン",
                "トースト",
                "エッグ",
                "ハム", "ベーコン", "ソーセージ",
                "団子", "餅",
                "アイス", "シャーベット",
                "タピオカ",
                )),
        (__FOOD_LAYER__ + "drink", "飲み物",
            (
                "飲み物", "ドリンク",
                "アルコール", "酒", "ワイン", "ビール",
                "お茶", "緑茶",
                "紅茶", "アールグレイ", "アールグレィ", "ダージリン",
                "珈琲", "コーヒー", "カフェオレ", "カプチーノ",
                "ジュース",
                "水", "ウォーター",
                )),
        (__FOOD_LAYER__ + "fruit", "果物",
            (
                "果物",
                "苺", "いちご", "ストロベリー",
                "桃", "もも", "ピーチ",
                "梨", "なし",
                )),
        )
