# -*- coding: utf-8 -*-
__VERSION__ = "0.2.10"


## common defines
__MAX_PRIORYTY__ = 10
__MIN_PRIORITY__ = 0
__DEF_PRIORITY__ = 5
__DEF_LAYER__ = "__default__"
__MAIN_LAYER__ = "__main__"
__STAGE_LAYER__ = "__stage__"
__FASHION_LAYER__ = "__fashion__"
__FOOD_LAYER__ = "__food__"


## meta data
STAGE_LAYERS = (
        (__STAGE_LAYER__ + "building", "建物",
            (
                "壁",
                "天井",
                "床",
                "屋根",
                ),),
        (__STAGE_LAYER__ + "outside", "屋外",
            (
                "道路", "路", "路地",
                "ビル", "テナント",
                "アパート",
                "マンション",
                "一軒家",
                "スーパー", "商店", "店",
                "噴水",)),
        (__STAGE_LAYER__ + "inside", "屋内",
            (
                "畳",
                "本棚",
                "キッチン", "台所",
                "リビング", "居間",
                "ダイニング", "食堂",
                )),
        (__STAGE_LAYER__ + "fantasy", "ファンタジー",
            (
                "城",
                "砦",
                ),),
        )

FASHION_LAYERS = (
        (__FASHION_LAYER__ + "clothes", "服装",
            (
                "服", "七部丈", "半袖", "短パン",
                "着物", "和服", "襦袢", "帯",
                )),
        (__FASHION_LAYER__ + "tops", "トップ",
            (
                "上着", "セーター", "Ｔシャツ", "シャツ", "ジャンパー", "ジージャン", "コート",
                "スタジャン", "スカジャン", "ドレス", "ワンピース", "キャミソール", "キャミ",
                )),
        (__FASHION_LAYER__ + "bottoms", "ボトム",
            (
                "ズボン", "ジーパン", "デニム", "半ズボン", "ハーフパンツ",
                "ジャージ", "ツナギ", "つなぎ",
                )),
        (__FASHION_LAYER__ + "under", "下着",
            (
                "下着", "ブラ", "ブラジャー", "パンツ", "パンティ", "ショーツ", "トランクス", "ブリーフ",
                "ストッキング", "ニーハイ", "靴下", "レッグウォーマー", "アームウォーマー",
                )),
        (__FASHION_LAYER__ + "shoes", "靴",
            (
                "靴", "革靴", "ブーツ", "長靴", "シューズ",
                "ヒール", "スニーカー", "草履", "雪駄", "下駄",
                )),
        (__FASHION_LAYER__ + "items", "小物",
            (
                "帽子", "ハット", "キャップ", "ベレー帽", "ベレィ帽",
                "リストバンド",
                "手袋",
                "スカーフ", "ストール",
                "ネクタイ",
                "眼鏡", "サングラス", "グラス",
                "かんざし", "簪", "ヘアバンド", "カチューシャ", "リボン",
                )),
        (__FASHION_LAYER__ + "faces", "外見",
            (
                "髪",
                "肌",
                "目", "瞳", "眼",
                "鼻",
                "口", "唇",
                "体", "身体",
                "手",
                "足",
                )),
        )

FOOD_LAYERS = (
        (__FOOD_LAYER__ + "food", "食べ物",
            (
                "食べ物",
                "朝食", "昼食", "夕食", "夜食", "間食", "完食",
                "麺", "うどん", "饂飩", "蕎麦", "そば", "ラーメン", "パスタ", "スパゲッティ", "焼きそば", "やきそば",
                "ご飯", "白米", "玄米", "ごはん",
                "寿司",
                "味噌汁", "みそ汁",
                "漬物", "お新香", "おしんこ",
                "スープ", "シチュー", "ポトフ",
                "おかず",
                "回鍋肉", "ホイコーロー", "麻婆豆腐", "マーボー豆腐",
                "サムゲタン", "参鶏湯",
                "サムギョプサル",
                "カレー",
                "オムライス", "オムレツ",
                "目玉焼き",
                "パン",
                "トースト",
                "エッグ",
                "ハム", "ベーコン", "ソーセージ",
                "団子", "餅",
                "アイス", "シャーベット",
                "タピオカ",
                )),
        (__FOOD_LAYER__ + "drink", "飲み物",
            (
                "飲み物", "ドリンク",
                "アルコール", "酒", "ワイン", "ビール",
                "お茶", "緑茶",
                "紅茶", "アールグレイ", "アールグレィ", "ダージリン",
                "珈琲", "コーヒー", "カフェオレ", "カプチーノ",
                "ジュース",
                "水", "ウォーター",
                )),
        )
